[
  {
    "version": "2.0.43",
    "features": [
      "連合艦隊の編成キャプチャで中央に線をひいとく修正",
      "任務着手忘れ防止アラート機能の実装",
      "スクショ直接ダウンロード時に画面下部にファイルバーが出ちゃうの修正",
      "連合艦隊の大破進撃防止窓の別窓表示を実装",
      "ツイートするためにスクショや編成キャプチャの画像サイズを綺麗に減らす機能を追加",
      "大破進撃防止窓の最前面固定をなんとかして実現した",
      "実績記録の週次記録を月曜5時にリセットする機能をやっと追加（たぶんうごく）",
      "実績記録であとまわしにしてたやつだいたい全部追加"
    ],
    "date": "2017/02/15",
    "comment": "『艦これウィジェット』の連合艦隊の大破進撃防止窓は、クリックを検知して第二艦隊撮ってるので、素早くダブルクリックしたら第一艦隊x2となります。そういうのが嫌な人は他の通信結果見るツールなどを使ってください。"
  },
  {
    "version": "2.0.42",
    "features": [
      "設定画面が開かないバグ修正"
    ],
    "date": "2017/02/05",
    "comment": null
  },
  {
    "version": "2.0.41",
    "features": [
      "設定画面に現在のバージョンとリリースノートを表示するよう変更",
      "通知ポップアップが見えたまんま/自動で消える設定を変えれるようにした",
      "右上ポップアップにLAUNCHボタンを設置",
      "クロックモードのマニュアルタイマー登録からタイマー解除できるようした",
      "クロックモードからタイマーの手動上書きが動いてなかった問題の修正",
      "クロックモードのタイマーマニュアル登録ダイアログで、すでに登録されている場合はその値を表示するようにした",
      "高速修復/建造材を使った時にタイマーを登録しない修正",
      "リリースノートをコミットメッセージから収集して生成するやつを作った",
      "ほかにもこんなにすごいことができるようになりました"
    ],
    "date": "2017/02/05",
    "comment": null
  },
  {
    "version": "2.0.40",
    "date": "2017/02/01",
    "features": [
      "タイマーは使うけど通知ポップアップはいらないという設定を追加",
      "任務進捗が地味にバグってたので修正",
      "Twitter認証を切ったときの運営電文の挙動を修正",
      "遠征強化令の発令で通知ポップアップを選択できるようにした"
    ],
    "comment": "遠征強化令の設定を変えたので、設定してた人は一時的に無効になってる気がします。 ┌(┌^p^)┐ イベント近いのに弾薬無いよぅ..."
  },
  {
    "version": "2.0.39",
    "date": "2017/01/31",
    "features": [
      "うっかり閉じるボタンを押しちゃったときにアラート出す機能を追加",
      "「遠征強化令」機能を追加",
      "バグ報告画面にバグがあったので修正"
    ],
    "comment": "もうイベントなの... 資源ぜんぜん貯まってない... 特に弾薬..."
  },
  {
    "version": "2.0.38",
    "date": "2017/01/29",
    "features": [
      "ゲーム画面内ボタンにスクショボタンを追加",
      "画像認識による修復入渠時間取得を失敗したときに手動登録できるようにした",
      "別窓表示した大破進撃防止窓をクリックしたらフォーカスがゲームに移るようにした",
      "WHITEモードでゲーム内ボタンが表示されていたバグを修正"
    ],
    "comment": "そろそろv1をリプレースします。v1がv2でリプレースされると、v2のストアのリンクは消えるので、ご注意ください。ゲーム内ボタン、右上より左下のほうがいいかもしれない。あと、もしかしたらボタンごとに表示/非表示が選べるといいかもしれない。"
  },
  {
    "version": "2.0.37",
    "date": "2017/01/27",
    "features": [
      "大破進撃防止窓の設定が「使用しない」にもかかわらず、6-5の連合艦隊マスで大破進撃防止窓が出るバグの修正",
      "運営電文を表示していないときに背景カスタマイズがさみしいので、画像の右下を優先的に表示するようにした",
      "デイリー任務進捗管理表をクロックモードに追加した",
      "なるべく最後のミュート状態を覚えておいて次回LAUNCH時に反映させるようにした",
      "改修工廠早見表が表示されていなかったバグを修正"
    ],
    "comment": "v2を試す際はv1を完全に削除してください。デイリー任務進捗表を実装しましたが、マニュアルで達成にする機能や、未着手アラートは未実装です。機能要望からissueをたててください。"
  },
  {
    "version": "2.0.36",
    "date": "2017/01/22",
    "features": [
      "クロックモードのタイマー表示にマウスオーバーで補完情報を表示するようにした",
      "自由文メモ帳機能をクロックモードに追加",
      "（APPモードのみ）ゲーム画面内でワンクリックでミュート/アンミュートできる設定を追加した",
      "バグ報告・機能要望をGitHubに投稿するための画面を追加した",
      "設定画面からTwitter連携をオン/オフできるようにした",
      "運営電文を右上ポップアップに表示する機能を追加",
      "右上ポップアップの背景をカスタマイズできるようにした（ついでに設定の背景も）"
    ],
    "comment": "v2を試す際はv1を完全に削除してください。運営電文の取得を、ウェブページのクロールではなくTwitterAPIを使用するように変更したため、Twitterの連携が必須になりました。あとデイリー任務進捗つくればv1を完全にリプレースできるかなと思っています。"
  },
  {
    "version": "2.0.35",
    "date": "2017/01/14",
    "features": [
      "大破進撃防止窓がちょっとずつ大きくなるバグの修正",
      "ゲーム画面が最後に配置されていた位置を記憶する機能の不具合の調査・修正",
      "複数PC間同期機能が壊れていたので修正"
    ],
    "comment": null
  },
  {
    "version": "2.0.34",
    "date": "2017/01/11",
    "features": [
      "通知のタイムライン表示がやっぱり壊れてたバグを修正",
      "大きめのスクショしたらabout:blankページになっちゃうバグを修正",
      "ゲーム画面が存在しているときはスクショアイコンを右上に表示するようにした",
      "動画を撮れるようにした（WebMだけど）"
    ],
    "comment": "v2を試す際は、v1を完全に削除してください。chrome://extensionsの最下部の「キーボードショートカット」のところで、動画キャプチャのキーボードショートカットを登録すると、動画が撮れるようになります。長さ制限とかまだ作ってないので、アホみたいに長時間とったら多分ブラウザがクラッシュします。やったね。"
  },
  {
    "version": "2.0.33",
    "date": "2017/01/10",
    "features": [
      "大破進撃防止窓のサイズと位置を記憶する修正",
      "設定した通知アイコンが反映されないバグを修正"
    ],
    "comment": "v2を試す際は、v1を完全に削除してください。大破進撃防止窓のサイズと位置指定をとりあえず追加しましたが、WindowsのAero領域考慮ができてないきがします。また、通知アイコンが反映されないバグをわりと雑に修正したので、登録済みの通知が一瞬消えるかもしれません。いずれにしても、削除して再インストールしてくれるとたすかります。"
  },
  {
    "version": "2.0.31",
    "date": "2016/12/24",
    "features": [
      "右上のタイマー表示形式が設定したものと逆になってたバグを修正",
      "クロックモードのマニュアル通知登録の艦隊/ドック指定が「表示における順番」になってたバグを修正",
      "通知アイコンを設定していない場合に、クロックモードの便利ボタン部分に艦これウィジェットちゃんさんが表示されてしまうバグを修正"
    ]
  },
  {
    "version": "2.0.30",
    "date": "2016/12/23",
    "features": [
      "建造が1分前に終わってたバグの修正",
      "クロックモードのサイズ記憶",
      "クロックモードをタブ形式かスクロール形式か選べる設定を追加",
      "クロックモードに設定済み通知アイコンを表示する修正",
      "タイマーを「残り時間表示」にできる設定を追加",
      "タイマーを「種類別残り時間順」にできる設定を追加"
    ],
    "comment": "タイマー表示形式のバリエーションが増えたことに伴って設定名が若干変わっているので、既存の設定が反映されないかもしれません。その場合は設定しなおしてください。"
  },
  {
    "version": "2.0.29",
    "date": "2016/12/21",
    "features": [
      "バッジ色の変更",
      "大破進撃防止窓をゲーム外に表示する設定を追加",
      "右上のタイマー表示でタイムライン形式を選択できる設定を追加"
    ],
    "comment": null
  }
]