/***** class definition *****/

/* static */
var Constants = {/** constantアクセサ的なアレ **/
    time :{
        mission : {
             "1" : 15,
             "2" : 30,
             "3" : 20,
             "4" : 50,
             "5" : 90,
             "6" : 40,
             "7" : 60,
             "8" : 180,
             "9" : 240,
            "10" : 90,
            "11" : 300,
            "12" : 480,
            "13" : 240,
            "14" : 360,
            "15" : 720,
            "16" : 900,
            "17" : 45,
            "18" : 300,
            "19" : 360,
            "20" : 120,
            "25" : 2400,
            "26" : 4800,
            "27" : 1200
        }
    },
    widget : {
        titles : [
            "艦これウィジェット",
            "艦これウィジェット",
            "艦これウィジェット",
            "あかつきの水平線に勝利を刻むのです"
        ],
        width : {
            '1200': {
                zoom : '1.5',
                mode : 'l'
            },
            '800' : {
                zoom : '1',
                mode : 'm'
            },
            '600' : {
                zoom : '0.75',
                mode : 's'
            },
            '400' : {
                zoom : '0.5',
                mode : 'xs'
            }
        }
    },
    ahievements : {
        'mission_count'  : '遠征',
        'map_count'      : '出撃',
        'hokyu_count'    : '補給',
        'kaisou_count'   : '近改',
        'practice_count' : '演習'
    }
};
